Artillery_tests/artillery-FMDiSC_test_1_api.yml
config:
  target: 'https://d3tests.top/fmi/data/v1/databases/Contacts_100/layouts/contact_list_api'
  phases:
    - duration: 5
      arrivalRate: 2
scenarios:
  - flow:
      - get:
          url: '/records'
          headers:
            content-type: 'application/json'
            authorization: 'Bearer 4391175b6d3cc2f7ae366bedd19791d748c900fedb57ecb80ee2'